#+TITLE: February 6-18, 2019 (13 days)
#+AUTHOR: dgplug.org
#+EMAIL: users@lists.dgplug.org
#+PROPERTY: Effort_ALL 0 0:05 0:10 0:30 1:00 2:00 3:00 4:00
#+COLUMNS: %35ITEM %TASKID %OWNER %3PRIORITY %TODO %5ESTIMATED{+} %3ACTUAL{+}
* REPORTS
** SCRUM BOARD
#+BEGIN: block-update-board
| TODO | NEXT | IN_PROGRESS | WAITING | DONE | CANCELED |
|------+------+-------------+---------+------+----------|
#+END:
** DEVELOPER SUMMARY
#+BEGIN: block-update-summary
| NAME             | ESTIMATED | ACTUAL | DONE | REMAINING | PENCILS DOWN | PROGRESS   |
|------------------+-----------+--------+------+-----------+--------------+------------|
| Sidntrivedi      |         0 |      0 |    0 |         0 |   2019-02-13 | ---------- |
| Sandeepk         |         0 |      0 |    0 |         0 |   2019-02-13 | ---------- |
| Nightwarrior-Xxx |         0 |      0 |    0 |         0 |   2019-02-13 | ---------- |
| Bhavin192        |         0 |      0 |    0 |         0 |   2019-02-13 | ---------- |
#+END:
** BURNDOWN CHART
#+BEGIN: block-update-graph

#+END:
** BURNDOWN LIST
#+PLOT: title:"Burndown" ind:1 deps:(3 4) set:"term dumb" set:"xtics scale 0.5" set:"ytics scale 0.5" file:"burndown.plt" set:"xrange [0:13]"
#+BEGIN: block-update-burndown
| DAY |       DATE | ACTUAL | IDEAL | TASKS COMPLETED |
|-----+------------+--------+-------+-----------------|
|   1 | 2019-02-06 |  41.25 |    38 |                 |
|   2 | 2019-02-07 |  41.25 |    35 |                 |
|   3 | 2019-02-08 |  41.25 |    32 |                 |
|   4 | 2019-02-09 |  41.25 |    29 |                 |
|   5 | 2019-02-10 |  41.25 |    25 |                 |
|   6 | 2019-02-11 |  41.25 |    22 |                 |
|   7 | 2019-02-12 |  41.25 |    19 |                 |
|   8 | 2019-02-13 |  41.25 |    16 |                 |
|   9 | 2019-02-14 |        |    13 |                 |
|  10 | 2019-02-15 |        |    10 |                 |
|  11 | 2019-02-16 |        |     6 |                 |
|  12 | 2019-02-17 |        |     3 |                 |
|  13 | 2019-02-18 |        |     0 |                 |
#+END:
** TASK LIST
#+BEGIN: columnview :hlines 2 :maxlevel 5 :id "TASKS"
| ITEM                        | TASKID           | OWNER            | PRIORITY | TODO | ESTIMATED | ACTUAL |
|-----------------------------+------------------+------------------+----------+------+-----------+--------|
| TASKS                       |                  |                  | B        |      |     41.25 |        |
|-----------------------------+------------------+------------------+----------+------+-----------+--------|
| bhavin192                   |                  |                  | B        |      |     12.75 |        |
| Learning Golang             |                  |                  | B        |      |      8.75 |        |
| Chapter 12. Reflection      | READ.1549470496  | bhavin192        | B        |      |         2 |        |
| Chapter 12 Exercises        | DEV.1549470564   | bhavin192        | B        |      |      6.75 |        |
| GNU Emacs bug triaging      | OPS.1549821237   | bhavin192        | B        |      |         2 |        |
| Write blog post about Emacs | WRITE.1549821271 | bhavin192        | B        |      |         2 |        |
|-----------------------------+------------------+------------------+----------+------+-----------+--------|
| nightwarrior-xxx            |                  |                  | B        |      |         5 |        |
| Learning Node               | DEV.1550008095   | nightwarrior-xxx | A        |      |         4 |        |
| Sharing the Learning        | WRTIE.1550008405 | nightwarrior-xxx | B        |      |         1 |        |
|-----------------------------+------------------+------------------+----------+------+-----------+--------|
| sandeepk                    |                  |                  | B        |      |        20 |        |
| Project Stacknews           | DEV.1549808449   | sandeepk         | B        |      |         8 |        |
| Vue JS                      | READ.1549808642  | sandeepk         | B        |      |         6 |        |
| Learning How to Learn       | READ.1549808796  | sandeepk         | B        |      |         4 |        |
| Emacs Bug Process           | READ.1549896237  | sandeepk         | B        |      |         2 |        |
|-----------------------------+------------------+------------------+----------+------+-----------+--------|
| sidntrivedi                 |                  |                  | B        |      |       3.5 |        |
| [[https://github.com/maxogden/art-of-node/#learn-node-interactively][Art of node]]                 | READ.1545566270  | sidntrivedi      | B        |      |      0.75 |        |
| DS/Algo Foundation          | READ.1549883885  | sidntrivedi      | B        |      |      1.75 |        |
| Linux for you and me        | READ.1538996950  | sidntrivedi      | B        |      |         1 |        |
#+END:
* TASKS
  :PROPERTIES:
  :ID:       TASKS
  :SPRINTLENGTH: 13
  :SPRINTSTART: <2019-02-06 Wed>
  :wpd-bhavin192: 1
  :wpd-nightwarrior-xxx: 1.2
  :wpd-sandeepk: 1.2
  :wpd-sidntrivedi: 0.5
  :END:
** bhavin192
*** Learning Golang
**** Chapter 12. Reflection [0/6]
     :PROPERTIES:
     :ESTIMATED: 2
     :ACTUAL:
     :OWNER:    bhavin192
     :ID:       READ.1549470496
     :TASKID:   READ.1549470496
     :END:
     - [ ] 12.1 Why Reflection?                      (7m)
     - [ ] 12.2 reflect.Type and reflect.Value       (15m)
     - [ ] 12.3 Display, a Recursive Value Printer   (40m)
     - [ ] 12.4 Example: Encoding S-Expressions      (25m)
     - [ ] 12.5 Setting Variables with reflect.Value (15m)
     - [ ] 12.6 Example: Decoding S-Expressions      (25m)
**** Chapter 12 Exercises [0/3]
     :PROPERTIES:
     :ESTIMATED: 6.75
     :ACTUAL:
     :OWNER:    bhavin192
     :ID:       DEV.1549470564
     :TASKID:   DEV.1549470564
     :END:
     - [ ] 12.3        (1.75h)
     - [ ] 12.4        (3h)
     - [ ] 12.6 Part I (7h)
*** GNU Emacs bug triaging
    :PROPERTIES:
    :ESTIMATED: 2
    :ACTUAL:
    :OWNER:    bhavin192
    :ID:       OPS.1549821237
    :TASKID:   OPS.1549821237
    :END:
    - [ ] [[https://debbugs.gnu.org/cgi/bugreport.cgi?bug=34268][#34268]]: wrong indentation in python mode
    - [ ] [[https://debbugs.gnu.org/cgi/bugreport.cgi?bug=34330][#34330]]: shell auto-complete cannot handle special characters
    - [ ] [[https://debbugs.gnu.org/cgi/bugreport.cgi?bug=34287][#34287]]: dired-do-rename vs. ls -R switch
    - [ ] [[https://debbugs.gnu.org/cgi/bugreport.cgi?bug=34267][#34267]]: Multiple themes in M-x customize-themes
    - [ ] [[https://debbugs.gnu.org/cgi/bugreport.cgi?bug=34397][#34397]]: completion forgets to escape "?"
*** Write blog post about Emacs
    :PROPERTIES:
    :ESTIMATED: 2
    :ACTUAL:
    :OWNER:    bhavin192
    :ID:       WRITE.1549821271
    :TASKID:   WRITE.1549821271
    :END:
** nightwarrior-xxx
*** [#A] Learning Node [/]
         :PROPERTIES:
         :ESTIMATED: 4
         :ACTUAL:
         :OWNER: nightwarrior-xxx
         :ID: DEV.1550008095
         :TASKID: DEV.1550008095
         :END:
         - [ ] ES6/ES7
         - [ ] MongoDB
         - [ ] Express
         - [ ] Socket.IO
*** [#B] Sharing the Learning 
         :PROPERTIES:
         :ESTIMATED: 1
         :ACTUAL:
         :OWNER: nightwarrior-xxx
         :ID: WRTIE.1550008405
         :TASKID: WRTIE.1550008405
         :END:
** sandeepk
*** DONE Project Stacknews [2/2]
    :PROPERTIES:
    :ESTIMATED: 8
    :ACTUAL:   7.33
    :OWNER: sandeepk
    :ID: DEV.1549808449
    :TASKID: DEV.1549808449
    :END:
    :LOGBOOK:
    CLOCK: [2019-02-17 Sun 16:00]--[2019-02-17 Sun 18:00] =>  2:00
    CLOCK: [2019-02-16 Sat 18:00]--[2019-02-16 Sat 19:00] =>  1:00
    CLOCK: [2019-02-10 Sun 16:00]--[2019-02-10 Sun 17:30] =>  1:30
    CLOCK: [2019-02-09 Sat 21:00]--[2019-02-09 Sat 22:20] =>  1:20
    CLOCK: [2019-02-09 Sat 13:00]--[2019-02-09 Sat 14:30] =>  1:30
    :END:
    - [X] User Add/Delete/Password Forget (4h)
    - [X] Post Add/Delete (4h)
*** TODO Vue JS [0/1]
    :PROPERTIES:
    :ESTIMATED: 6
    :ACTUAL:   3.00
    :OWNER: sandeepk
    :ID: READ.1549808642
    :TASKID: READ.1549808642
    :END:
    :LOGBOOK:
    CLOCK: [2019-02-16 Sat 14:00]--[2019-02-16 Sat 16:00] =>  2:00
    CLOCK: [2019-02-16 Sat 11:30]--[2019-02-16 Sat 12:30] =>  1:00
    :END:
    - [ ] Essentials (6h)
*** DONE Learning How to Learn [1/1]
    :PROPERTIES:
    :ESTIMATED: 4
    :ACTUAL:   4.00
    :OWNER: sandeepk
    :ID: READ.1549808796
    :TASKID: READ.1549808796
    :END:
    :LOGBOOK:
    CLOCK: [2019-02-15 Fri 20:20]--[2019-02-15 Fri 21:30] =>  1:10
    CLOCK: [2019-02-13 Wed 20:00]--[2019-02-13 Wed 21:00] =>  1:00
    CLOCK: [2019-02-08 Fri 21:00]--[2019-02-08 Fri 21:50] =>  0:50
    CLOCK: [2019-02-07 Thu 20:30]--[2019-02-07 Thu 21:30] =>  1:00
    :END:
    - [X] Renaissance Learning and Unlocking Your Potential (4h)
*** DONE Emacs Bug Process [2/2]
    :PROPERTIES:
    :ESTIMATED: 2
    :ACTUAL:   1.42
    :OWNER: sandeepk
    :ID: READ.1549896237
    :TASKID: READ.1549896237
    :END:
    :LOGBOOK:
    CLOCK: [2019-02-17 Sun 12:00]--[2019-02-17 Sun 12:45] =>  0:45
    CLOCK: [2019-02-15 Fri 17:30]--[2019-02-15 Fri 18:10] =>  0:40
    :END:
    - [X] https://debbugs.gnu.org/server-control.html (1h)
    - [X] https://debbugs.gnu.org/server-request.html#introduction (1h)
** sidntrivedi
*** [[https://github.com/maxogden/art-of-node/#learn-node-interactively][Art of node]]
    :PROPERTIES:
    :ESTIMATED: 0.75
    :ACTUAL:
    :OWNER: sidntrivedi
    :ID: READ.1545566270
    :TASKID: READ.1545566270
    :END:      
    - [ ] Understanding Node
*** IN_PROGRESS DS/Algo Foundation
    :PROPERTIES:
    :ESTIMATED: 1.75
    :ACTUAL:   1.02
    :OWNER: sidntrivedi
    :ID: READ.1549883885
    :TASKID: READ.1549883885
    :END:
    :LOGBOOK:  
    CLOCK: [2019-02-14 Thu 19:17]--[2019-02-14 Thu 20:18] =>  1:01
    :END:      
    - [ ] Asymptotic analysis (Big-O notation)
*** Linux for you and me
    :PROPERTIES:
    :ESTIMATED: 1
    :ACTUAL:
    :OWNER: sidntrivedi
    :ID: READ.1538996950
    :TASKID: READ.1538996950
    :END:      
    - [ ] File Permissions	()
